package chapter07;

public class Java01_Collection {
    public static void main(String[] args) {

        //TODO 集合
        // 生活中也有集合的概念，是一个动词

        //Java中的集合是一种名词，数据的一种容器。用于容纳数据
        //Java提供了完整的集合框架

        //TODO 问题：什么时候需要一个容纳数据的容器，就是集合对象？
        //          Java集合框架中就包含了对不确定个数的数据处理的集合类
        //TODO 问题：如果为了容纳数据，可以直接使用数据，为什么要学习集合
        //          数组使用起来不方便。在数据个数不确定场合，数组使用起来不方便

        //TODO 总结：对不确定的有关系的数据进行相同的逻辑处理的场合，使用集合是一个不错的选择

        //TODO 根据库数据的不同，Java的集合分为两大体系
        //1、单一数据体系：Collection接口定义了相关的规则
        //2、成对出现的数据体系：Collection和Map接口定义了相关的规则
        //   成对出现就是：两个数据有关系，可以更具第一个数据关联到第二个数据
        //   也称之为键值对数据,(123123,zhangsan) => (key,value)

    }
}
